app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "remember_token") VALUES('Example User', 'user4@example.com', '2010-03-31 19:48:29', '2010-03-31 19:48:29', 'eca3fb34330e2cfba0c306a1da854e98b9b47bc9287397d1b839cd93adf5a4b8', '69d862bba094eb0819d03875f71c931c58d1bdfab874d0af13da341a7e3ebae9', NULL)